openfoam/OpenFOAM-dev/tutorials/incompressibleFluid/movingCone/0/pointMotionUx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       pointScalarField;
    object      pointMotionUx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

movement
{
    type            uniformFixedValue;

    uniformValue
    {
        type            square;

        amplitude       1;
        frequency       150;
        start           0;
        level           0;
    }
}


boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    movingWall
    {
        $movement;
    }

    farFieldMoving
    {
        $movement;
    }

    fixedWall
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }

    left
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }

    farField
    {
        type            slip;
    }
}

// ************************************************************************* //
